{
  "backend/main.mo": "Implements user profile storage and livestream management with access‑controlled updates and queries using Map and AccessControl.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence for the livestream app.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend files including components, pages, hooks, and utilities.",
  "frontend/index.css": "Defines global Tailwind CSS styles and theme variables for light and dark mode using OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages in the AppLayout component.",
  "frontend/src/components/AppLayout.tsx": "Page layout component with banner, logo, navigation, footer, and slot for content.",
  "frontend/src/components/AuthButton.tsx": "Internet Identity sign-in/out button handling authentication state and query cache clearing.",
  "frontend/src/components/PrimaryNav.tsx": "Renders main navigation buttons for YouTube, Facebook, Audio, Member, and Clover pages with active highlighting.",
  "frontend/src/components/RequireAuth.tsx": "Authentication guard that shows a sign‑in prompt or loading state before rendering protected content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing on identity changes and invalidating related queries.",
  "frontend/src/hooks/useAudioMonitor.ts": "React hook that lists audio input devices and manages starting, stopping, and adjusting volume for a live audio monitor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login/logout flows, and initializes AuthClient with stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query for fetching and saving user profiles and livestream data.",
  "frontend/src/index.css": "Tailwind CSS base setup defining light/dark theme variables and global styles.",
  "frontend/src/lib/clover/cloverConfig.ts": "Loads and saves Clover configuration to localStorage with defaults for merchant integration.",
  "frontend/src/lib/livestream/parseEmbedInput.ts": "Parses YouTube or Facebook embed inputs or URLs and returns a standardized responsive iframe snippet.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AudioInputPage.tsx": "UI page that uses the audio monitor hook to select devices, start/stop monitoring, and adjust volume.",
  "frontend/src/pages/CloverPlaceholderPage.tsx": "Placeholder UI for Clover integration allowing local configuration of merchant settings with no active processing.",
  "frontend/src/pages/MemberAreaPage.tsx": "Member-only page that loads the caller's profile, allows initial profile setup, and supports editing and saving the display name.",
  "frontend/src/pages/WatchLiveFacebookPage.tsx": "Displays the Facebook livestream and lets authenticated users edit and save the embedded stream code.",
  "frontend/src/pages/WatchLiveYouTubePage.tsx": "Shows the YouTube livestream and enables authenticated users to edit and save the embed code.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugin setup.",
  "project_state.json": "Project metadata describing features, requirements, architecture notes, and image needs for the church app."
}